
# Словарь содержащий информацию о чемпионатах по футболу в 21 веке
world_champions = {
    2002: 'Бразилия',
    2006: 'Италия',
    2010: 'Испания',
    2014: 'Германия',
    2018: 'Франция',
}

# 1. добавляем в словарь 2022 год, в котором чемпионом стала Аргентина
world_champions[2022] = 'Аргентина'

# 2. Выводим на экран всех чемпионов в формате 'год - страна'
for key, value in world_champions.items():
    print(key,'-',value)

# 3. Проверяем, выигрывала ли Италия в 21 веке.
country = 'Италия'

if country in world_champions.values():
    print(f"{country} становилась чемпионом мира по футболу в 21 веке!" )
else:
    print(f"{country} не выигрывала чемпионат мира по футболу в 21 веке." )